Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/include/component/pwm.h
/* -------- PWM_ENA : (PWM Offset: 0x04) (/W 32) PWM Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CHID0:1;                   /**< bit:      0  Channel ID                               */
    uint32_t CHID1:1;                   /**< bit:      1  Channel ID                               */
    uint32_t CHID2:1;                   /**< bit:      2  Channel ID                               */
    uint32_t CHID3:1;                   /**< bit:      3  Channel ID                               */
    uint32_t :28;                       /**< bit:  4..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CHID:4;                    /**< bit:   0..3  Channel ID                               */
    uint32_t :28;                       /**< bit:  4..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_ENA_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_ENA_OFFSET                      (0x04)                                        /**<  (PWM_ENA) PWM Enable Register  Offset */

#define PWM_ENA_CHID0_Pos                   0                                              /**< (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID0_Msk                   (_U_(0x1) << PWM_ENA_CHID0_Pos)                /**< (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID0                       PWM_ENA_CHID0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ENA_CHID0_Msk instead */
#define PWM_ENA_CHID1_Pos                   1                                              /**< (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID1_Msk                   (_U_(0x1) << PWM_ENA_CHID1_Pos)                /**< (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID1                       PWM_ENA_CHID1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ENA_CHID1_Msk instead */
#define PWM_ENA_CHID2_Pos                   2                                              /**< (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID2_Msk                   (_U_(0x1) << PWM_ENA_CHID2_Pos)                /**< (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID2                       PWM_ENA_CHID2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ENA_CHID2_Msk instead */
#define PWM_ENA_CHID3_Pos                   3                                              /**< (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID3_Msk                   (_U_(0x1) << PWM_ENA_CHID3_Pos)                /**< (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID3                       PWM_ENA_CHID3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ENA_CHID3_Msk instead */
#define PWM_ENA_MASK                        _U_(0x0F)                                      /**< \deprecated (PWM_ENA) Register MASK  (Use PWM_ENA_Msk instead)  */
#define PWM_ENA_Msk                         _U_(0x0F)                                      /**< (PWM_ENA) Register Mask  */

#define PWM_ENA_CHID_Pos                    0                                              /**< (PWM_ENA Position) Channel ID */
#define PWM_ENA_CHID_Msk                    (_U_(0xF) << PWM_ENA_CHID_Pos)                 /**< (PWM_ENA Mask) CHID */
#define PWM_ENA_CHID(value)                 (PWM_ENA_CHID_Msk & ((value) << PWM_ENA_CHID_Pos))  

/* -------- PWM_DIS : (PWM Offset: 0x08) (/W 32) PWM Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CHID0:1;                   /**< bit:      0  Channel ID                               */
    uint32_t CHID1:1;                   /**< bit:      1  Channel ID                               */
    uint32_t CHID2:1;                   /**< bit:      2  Channel ID                               */
    uint32_t CHID3:1;                   /**< bit:      3  Channel ID                               */
    uint32_t :28;                       /**< bit:  4..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CHID:4;                    /**< bit:   0..3  Channel ID                               */
    uint32_t :28;                       /**< bit:  4..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_DIS_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_DIS_OFFSET                      (0x08)                                        /**<  (PWM_DIS) PWM Disable Register  Offset */

#define PWM_DIS_CHID0_Pos                   0                                              /**< (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID0_Msk                   (_U_(0x1) << PWM_DIS_CHID0_Pos)                /**< (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID0                       PWM_DIS_CHID0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_DIS_CHID0_Msk instead */
#define PWM_DIS_CHID1_Pos                   1                                              /**< (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID1_Msk                   (_U_(0x1) << PWM_DIS_CHID1_Pos)                /**< (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID1                       PWM_DIS_CHID1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_DIS_CHID1_Msk instead */
#define PWM_DIS_CHID2_Pos                   2                                              /**< (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID2_Msk                   (_U_(0x1) << PWM_DIS_CHID2_Pos)                /**< (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID2                       PWM_DIS_CHID2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_DIS_CHID2_Msk instead */
#define PWM_DIS_CHID3_Pos                   3                                              /**< (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID3_Msk                   (_U_(0x1) << PWM_DIS_CHID3_Pos)                /**< (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID3                       PWM_DIS_CHID3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_DIS_CHID3_Msk instead */
#define PWM_DIS_MASK                        _U_(0x0F)                                      /**< \deprecated (PWM_DIS) Register MASK  (Use PWM_DIS_Msk instead)  */
#define PWM_DIS_Msk                         _U_(0x0F)                                      /**< (PWM_DIS) Register Mask  */

