Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/include/component/pwm.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_IMR1_OFFSET                     (0x18)                                        /**<  (PWM_IMR1) PWM Interrupt Mask Register 1  Offset */

#define PWM_IMR1_CHID0_Pos                  0                                              /**< (PWM_IMR1) Counter Event on Channel 0 Interrupt Mask Position */
#define PWM_IMR1_CHID0_Msk                  (_U_(0x1) << PWM_IMR1_CHID0_Pos)               /**< (PWM_IMR1) Counter Event on Channel 0 Interrupt Mask Mask */
#define PWM_IMR1_CHID0                      PWM_IMR1_CHID0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_IMR1_CHID0_Msk instead */
#define PWM_IMR1_CHID1_Pos                  1                                              /**< (PWM_IMR1) Counter Event on Channel 1 Interrupt Mask Position */
#define PWM_IMR1_CHID1_Msk                  (_U_(0x1) << PWM_IMR1_CHID1_Pos)               /**< (PWM_IMR1) Counter Event on Channel 1 Interrupt Mask Mask */
#define PWM_IMR1_CHID1                      PWM_IMR1_CHID1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_IMR1_CHID1_Msk instead */
#define PWM_IMR1_CHID2_Pos                  2                                              /**< (PWM_IMR1) Counter Event on Channel 2 Interrupt Mask Position */
#define PWM_IMR1_CHID2_Msk                  (_U_(0x1) << PWM_IMR1_CHID2_Pos)               /**< (PWM_IMR1) Counter Event on Channel 2 Interrupt Mask Mask */
#define PWM_IMR1_CHID2                      PWM_IMR1_CHID2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_IMR1_CHID2_Msk instead */
#define PWM_IMR1_CHID3_Pos                  3                                              /**< (PWM_IMR1) Counter Event on Channel 3 Interrupt Mask Position */
#define PWM_IMR1_CHID3_Msk                  (_U_(0x1) << PWM_IMR1_CHID3_Pos)               /**< (PWM_IMR1) Counter Event on Channel 3 Interrupt Mask Mask */
#define PWM_IMR1_CHID3                      PWM_IMR1_CHID3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_IMR1_CHID3_Msk instead */
#define PWM_IMR1_FCHID0_Pos                 16                                             /**< (PWM_IMR1) Fault Protection Trigger on Channel 0 Interrupt Mask Position */
#define PWM_IMR1_FCHID0_Msk                 (_U_(0x1) << PWM_IMR1_FCHID0_Pos)              /**< (PWM_IMR1) Fault Protection Trigger on Channel 0 Interrupt Mask Mask */
#define PWM_IMR1_FCHID0                     PWM_IMR1_FCHID0_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_IMR1_FCHID0_Msk instead */
#define PWM_IMR1_FCHID1_Pos                 17                                             /**< (PWM_IMR1) Fault Protection Trigger on Channel 1 Interrupt Mask Position */
#define PWM_IMR1_FCHID1_Msk                 (_U_(0x1) << PWM_IMR1_FCHID1_Pos)              /**< (PWM_IMR1) Fault Protection Trigger on Channel 1 Interrupt Mask Mask */
#define PWM_IMR1_FCHID1                     PWM_IMR1_FCHID1_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_IMR1_FCHID1_Msk instead */
#define PWM_IMR1_FCHID2_Pos                 18                                             /**< (PWM_IMR1) Fault Protection Trigger on Channel 2 Interrupt Mask Position */
#define PWM_IMR1_FCHID2_Msk                 (_U_(0x1) << PWM_IMR1_FCHID2_Pos)              /**< (PWM_IMR1) Fault Protection Trigger on Channel 2 Interrupt Mask Mask */
#define PWM_IMR1_FCHID2                     PWM_IMR1_FCHID2_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_IMR1_FCHID2_Msk instead */
#define PWM_IMR1_FCHID3_Pos                 19                                             /**< (PWM_IMR1) Fault Protection Trigger on Channel 3 Interrupt Mask Position */
#define PWM_IMR1_FCHID3_Msk                 (_U_(0x1) << PWM_IMR1_FCHID3_Pos)              /**< (PWM_IMR1) Fault Protection Trigger on Channel 3 Interrupt Mask Mask */
#define PWM_IMR1_FCHID3                     PWM_IMR1_FCHID3_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_IMR1_FCHID3_Msk instead */
#define PWM_IMR1_MASK                       _U_(0xF000F)                                   /**< \deprecated (PWM_IMR1) Register MASK  (Use PWM_IMR1_Msk instead)  */
#define PWM_IMR1_Msk                        _U_(0xF000F)                                   /**< (PWM_IMR1) Register Mask  */

#define PWM_IMR1_CHID_Pos                   0                                              /**< (PWM_IMR1 Position) Counter Event on Channel x Interrupt Mask */
#define PWM_IMR1_CHID_Msk                   (_U_(0xF) << PWM_IMR1_CHID_Pos)                /**< (PWM_IMR1 Mask) CHID */
#define PWM_IMR1_CHID(value)                (PWM_IMR1_CHID_Msk & ((value) << PWM_IMR1_CHID_Pos))  
#define PWM_IMR1_FCHID_Pos                  16                                             /**< (PWM_IMR1 Position) Fault Protection Trigger on Channel 3 Interrupt Mask */
#define PWM_IMR1_FCHID_Msk                  (_U_(0xF) << PWM_IMR1_FCHID_Pos)               /**< (PWM_IMR1 Mask) FCHID */
#define PWM_IMR1_FCHID(value)               (PWM_IMR1_FCHID_Msk & ((value) << PWM_IMR1_FCHID_Pos))  

/* -------- PWM_ISR1 : (PWM Offset: 0x1c) (R/ 32) PWM Interrupt Status Register 1 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CHID0:1;                   /**< bit:      0  Counter Event on Channel 0               */
    uint32_t CHID1:1;                   /**< bit:      1  Counter Event on Channel 1               */
    uint32_t CHID2:1;                   /**< bit:      2  Counter Event on Channel 2               */
    uint32_t CHID3:1;                   /**< bit:      3  Counter Event on Channel 3               */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t FCHID0:1;                  /**< bit:     16  Fault Protection Trigger on Channel 0    */
    uint32_t FCHID1:1;                  /**< bit:     17  Fault Protection Trigger on Channel 1    */
    uint32_t FCHID2:1;                  /**< bit:     18  Fault Protection Trigger on Channel 2    */
    uint32_t FCHID3:1;                  /**< bit:     19  Fault Protection Trigger on Channel 3    */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CHID:4;                    /**< bit:   0..3  Counter Event on Channel x               */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t FCHID:4;                   /**< bit: 16..19  Fault Protection Trigger on Channel 3    */
    uint32_t :12;                       /**< bit: 20..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_ISR1_Type;
