Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/include/component/pwm.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_FMR_OFFSET                      (0x5C)                                        /**<  (PWM_FMR) PWM Fault Mode Register  Offset */

#define PWM_FMR_FPOL_Pos                    0                                              /**< (PWM_FMR) Fault Polarity Position */
#define PWM_FMR_FPOL_Msk                    (_U_(0xFF) << PWM_FMR_FPOL_Pos)                /**< (PWM_FMR) Fault Polarity Mask */
#define PWM_FMR_FPOL(value)                 (PWM_FMR_FPOL_Msk & ((value) << PWM_FMR_FPOL_Pos))
#define PWM_FMR_FMOD_Pos                    8                                              /**< (PWM_FMR) Fault Activation Mode Position */
#define PWM_FMR_FMOD_Msk                    (_U_(0xFF) << PWM_FMR_FMOD_Pos)                /**< (PWM_FMR) Fault Activation Mode Mask */
#define PWM_FMR_FMOD(value)                 (PWM_FMR_FMOD_Msk & ((value) << PWM_FMR_FMOD_Pos))
#define PWM_FMR_FFIL_Pos                    16                                             /**< (PWM_FMR) Fault Filtering Position */
#define PWM_FMR_FFIL_Msk                    (_U_(0xFF) << PWM_FMR_FFIL_Pos)                /**< (PWM_FMR) Fault Filtering Mask */
#define PWM_FMR_FFIL(value)                 (PWM_FMR_FFIL_Msk & ((value) << PWM_FMR_FFIL_Pos))
#define PWM_FMR_MASK                        _U_(0xFFFFFF)                                  /**< \deprecated (PWM_FMR) Register MASK  (Use PWM_FMR_Msk instead)  */
#define PWM_FMR_Msk                         _U_(0xFFFFFF)                                  /**< (PWM_FMR) Register Mask  */


/* -------- PWM_FSR : (PWM Offset: 0x60) (R/ 32) PWM Fault Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FIV:8;                     /**< bit:   0..7  Fault Input Value                        */
    uint32_t FS:8;                      /**< bit:  8..15  Fault Status                             */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_FSR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_FSR_OFFSET                      (0x60)                                        /**<  (PWM_FSR) PWM Fault Status Register  Offset */

#define PWM_FSR_FIV_Pos                     0                                              /**< (PWM_FSR) Fault Input Value Position */
#define PWM_FSR_FIV_Msk                     (_U_(0xFF) << PWM_FSR_FIV_Pos)                 /**< (PWM_FSR) Fault Input Value Mask */
#define PWM_FSR_FIV(value)                  (PWM_FSR_FIV_Msk & ((value) << PWM_FSR_FIV_Pos))
#define PWM_FSR_FS_Pos                      8                                              /**< (PWM_FSR) Fault Status Position */
#define PWM_FSR_FS_Msk                      (_U_(0xFF) << PWM_FSR_FS_Pos)                  /**< (PWM_FSR) Fault Status Mask */
#define PWM_FSR_FS(value)                   (PWM_FSR_FS_Msk & ((value) << PWM_FSR_FS_Pos))
#define PWM_FSR_MASK                        _U_(0xFFFF)                                    /**< \deprecated (PWM_FSR) Register MASK  (Use PWM_FSR_Msk instead)  */
#define PWM_FSR_Msk                         _U_(0xFFFF)                                    /**< (PWM_FSR) Register Mask  */


/* -------- PWM_FCR : (PWM Offset: 0x64) (/W 32) PWM Fault Clear Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FCLR:8;                    /**< bit:   0..7  Fault Clear                              */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_FCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_FCR_OFFSET                      (0x64)                                        /**<  (PWM_FCR) PWM Fault Clear Register  Offset */

#define PWM_FCR_FCLR_Pos                    0                                              /**< (PWM_FCR) Fault Clear Position */
#define PWM_FCR_FCLR_Msk                    (_U_(0xFF) << PWM_FCR_FCLR_Pos)                /**< (PWM_FCR) Fault Clear Mask */
#define PWM_FCR_FCLR(value)                 (PWM_FCR_FCLR_Msk & ((value) << PWM_FCR_FCLR_Pos))
#define PWM_FCR_MASK                        _U_(0xFF)                                      /**< \deprecated (PWM_FCR) Register MASK  (Use PWM_FCR_Msk instead)  */
#define PWM_FCR_Msk                         _U_(0xFF)                                      /**< (PWM_FCR) Register Mask  */


/* -------- PWM_FPV1 : (PWM Offset: 0x68) (R/W 32) PWM Fault Protection Value Register 1 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FPVH0:1;                   /**< bit:      0  Fault Protection Value for PWMH output on channel 0 */
    uint32_t FPVH1:1;                   /**< bit:      1  Fault Protection Value for PWMH output on channel 1 */
    uint32_t FPVH2:1;                   /**< bit:      2  Fault Protection Value for PWMH output on channel 2 */
    uint32_t FPVH3:1;                   /**< bit:      3  Fault Protection Value for PWMH output on channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t FPVL0:1;                   /**< bit:     16  Fault Protection Value for PWML output on channel 0 */
    uint32_t FPVL1:1;                   /**< bit:     17  Fault Protection Value for PWML output on channel 1 */
    uint32_t FPVL2:1;                   /**< bit:     18  Fault Protection Value for PWML output on channel 2 */
    uint32_t FPVL3:1;                   /**< bit:     19  Fault Protection Value for PWML output on channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t FPVH:4;                    /**< bit:   0..3  Fault Protection Value for PWMH output on channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t FPVL:4;                    /**< bit: 16..19  Fault Protection Value for PWML output on channel 3 */
    uint32_t :12;                       /**< bit: 20..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_FPV1_Type;
