Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/include/component/pwm.h
/* -------- PWM_FPV2 : (PWM Offset: 0xc0) (R/W 32) PWM Fault Protection Value 2 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FPZH0:1;                   /**< bit:      0  Fault Protection to Hi-Z for PWMH output on channel 0 */
    uint32_t FPZH1:1;                   /**< bit:      1  Fault Protection to Hi-Z for PWMH output on channel 1 */
    uint32_t FPZH2:1;                   /**< bit:      2  Fault Protection to Hi-Z for PWMH output on channel 2 */
    uint32_t FPZH3:1;                   /**< bit:      3  Fault Protection to Hi-Z for PWMH output on channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t FPZL0:1;                   /**< bit:     16  Fault Protection to Hi-Z for PWML output on channel 0 */
    uint32_t FPZL1:1;                   /**< bit:     17  Fault Protection to Hi-Z for PWML output on channel 1 */
    uint32_t FPZL2:1;                   /**< bit:     18  Fault Protection to Hi-Z for PWML output on channel 2 */
    uint32_t FPZL3:1;                   /**< bit:     19  Fault Protection to Hi-Z for PWML output on channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t FPZH:4;                    /**< bit:   0..3  Fault Protection to Hi-Z for PWMH output on channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t FPZL:4;                    /**< bit: 16..19  Fault Protection to Hi-Z for PWML output on channel 3 */
    uint32_t :12;                       /**< bit: 20..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_FPV2_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_FPV2_OFFSET                     (0xC0)                                        /**<  (PWM_FPV2) PWM Fault Protection Value 2 Register  Offset */

#define PWM_FPV2_FPZH0_Pos                  0                                              /**< (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 0 Position */
#define PWM_FPV2_FPZH0_Msk                  (_U_(0x1) << PWM_FPV2_FPZH0_Pos)               /**< (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 0 Mask */
#define PWM_FPV2_FPZH0                      PWM_FPV2_FPZH0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV2_FPZH0_Msk instead */
#define PWM_FPV2_FPZH1_Pos                  1                                              /**< (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 1 Position */
#define PWM_FPV2_FPZH1_Msk                  (_U_(0x1) << PWM_FPV2_FPZH1_Pos)               /**< (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 1 Mask */
#define PWM_FPV2_FPZH1                      PWM_FPV2_FPZH1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV2_FPZH1_Msk instead */
#define PWM_FPV2_FPZH2_Pos                  2                                              /**< (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 2 Position */
#define PWM_FPV2_FPZH2_Msk                  (_U_(0x1) << PWM_FPV2_FPZH2_Pos)               /**< (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 2 Mask */
#define PWM_FPV2_FPZH2                      PWM_FPV2_FPZH2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV2_FPZH2_Msk instead */
#define PWM_FPV2_FPZH3_Pos                  3                                              /**< (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 3 Position */
#define PWM_FPV2_FPZH3_Msk                  (_U_(0x1) << PWM_FPV2_FPZH3_Pos)               /**< (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 3 Mask */
#define PWM_FPV2_FPZH3                      PWM_FPV2_FPZH3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV2_FPZH3_Msk instead */
#define PWM_FPV2_FPZL0_Pos                  16                                             /**< (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 0 Position */
#define PWM_FPV2_FPZL0_Msk                  (_U_(0x1) << PWM_FPV2_FPZL0_Pos)               /**< (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 0 Mask */
#define PWM_FPV2_FPZL0                      PWM_FPV2_FPZL0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV2_FPZL0_Msk instead */
#define PWM_FPV2_FPZL1_Pos                  17                                             /**< (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 1 Position */
#define PWM_FPV2_FPZL1_Msk                  (_U_(0x1) << PWM_FPV2_FPZL1_Pos)               /**< (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 1 Mask */
#define PWM_FPV2_FPZL1                      PWM_FPV2_FPZL1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV2_FPZL1_Msk instead */
#define PWM_FPV2_FPZL2_Pos                  18                                             /**< (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 2 Position */
#define PWM_FPV2_FPZL2_Msk                  (_U_(0x1) << PWM_FPV2_FPZL2_Pos)               /**< (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 2 Mask */
#define PWM_FPV2_FPZL2                      PWM_FPV2_FPZL2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV2_FPZL2_Msk instead */
#define PWM_FPV2_FPZL3_Pos                  19                                             /**< (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 3 Position */
#define PWM_FPV2_FPZL3_Msk                  (_U_(0x1) << PWM_FPV2_FPZL3_Pos)               /**< (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 3 Mask */
#define PWM_FPV2_FPZL3                      PWM_FPV2_FPZL3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV2_FPZL3_Msk instead */
#define PWM_FPV2_MASK                       _U_(0xF000F)                                   /**< \deprecated (PWM_FPV2) Register MASK  (Use PWM_FPV2_Msk instead)  */
#define PWM_FPV2_Msk                        _U_(0xF000F)                                   /**< (PWM_FPV2) Register Mask  */

#define PWM_FPV2_FPZH_Pos                   0                                              /**< (PWM_FPV2 Position) Fault Protection to Hi-Z for PWMH output on channel x */
#define PWM_FPV2_FPZH_Msk                   (_U_(0xF) << PWM_FPV2_FPZH_Pos)                /**< (PWM_FPV2 Mask) FPZH */
#define PWM_FPV2_FPZH(value)                (PWM_FPV2_FPZH_Msk & ((value) << PWM_FPV2_FPZH_Pos))  
#define PWM_FPV2_FPZL_Pos                   16                                             /**< (PWM_FPV2 Position) Fault Protection to Hi-Z for PWML output on channel 3 */
#define PWM_FPV2_FPZL_Msk                   (_U_(0xF) << PWM_FPV2_FPZL_Pos)                /**< (PWM_FPV2 Mask) FPZL */
#define PWM_FPV2_FPZL(value)                (PWM_FPV2_FPZL_Msk & ((value) << PWM_FPV2_FPZL_Pos))  

/* -------- PWM_WPCR : (PWM Offset: 0xe4) (/W 32) PWM Write Protection Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPCMD:2;                   /**< bit:   0..1  Write Protection Command                 */
    uint32_t WPRG0:1;                   /**< bit:      2  Write Protection Register Group 0        */
    uint32_t WPRG1:1;                   /**< bit:      3  Write Protection Register Group 1        */
    uint32_t WPRG2:1;                   /**< bit:      4  Write Protection Register Group 2        */
    uint32_t WPRG3:1;                   /**< bit:      5  Write Protection Register Group 3        */
    uint32_t WPRG4:1;                   /**< bit:      6  Write Protection Register Group 4        */
    uint32_t WPRG5:1;                   /**< bit:      7  Write Protection Register Group 5        */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                     */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t WPRG:6;                    /**< bit:   2..7  Write Protection Register Group x        */
    uint32_t :24;                       /**< bit:  8..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_WPCR_Type;
