Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/include/component/pwm.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_WPCR_OFFSET                     (0xE4)                                        /**<  (PWM_WPCR) PWM Write Protection Control Register  Offset */

#define PWM_WPCR_WPCMD_Pos                  0                                              /**< (PWM_WPCR) Write Protection Command Position */
#define PWM_WPCR_WPCMD_Msk                  (_U_(0x3) << PWM_WPCR_WPCMD_Pos)               /**< (PWM_WPCR) Write Protection Command Mask */
#define PWM_WPCR_WPCMD(value)               (PWM_WPCR_WPCMD_Msk & ((value) << PWM_WPCR_WPCMD_Pos))
#define   PWM_WPCR_WPCMD_DISABLE_SW_PROT_Val _U_(0x0)                                       /**< (PWM_WPCR) Disables the software write protection of the register groups of which the bit WPRGx is at '1'.  */
#define   PWM_WPCR_WPCMD_ENABLE_SW_PROT_Val _U_(0x1)                                       /**< (PWM_WPCR) Enables the software write protection of the register groups of which the bit WPRGx is at '1'.  */
#define   PWM_WPCR_WPCMD_ENABLE_HW_PROT_Val _U_(0x2)                                       /**< (PWM_WPCR) Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface.  */
#define PWM_WPCR_WPCMD_DISABLE_SW_PROT      (PWM_WPCR_WPCMD_DISABLE_SW_PROT_Val << PWM_WPCR_WPCMD_Pos)  /**< (PWM_WPCR) Disables the software write protection of the register groups of which the bit WPRGx is at '1'. Position  */
#define PWM_WPCR_WPCMD_ENABLE_SW_PROT       (PWM_WPCR_WPCMD_ENABLE_SW_PROT_Val << PWM_WPCR_WPCMD_Pos)  /**< (PWM_WPCR) Enables the software write protection of the register groups of which the bit WPRGx is at '1'. Position  */
#define PWM_WPCR_WPCMD_ENABLE_HW_PROT       (PWM_WPCR_WPCMD_ENABLE_HW_PROT_Val << PWM_WPCR_WPCMD_Pos)  /**< (PWM_WPCR) Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface. Position  */
#define PWM_WPCR_WPRG0_Pos                  2                                              /**< (PWM_WPCR) Write Protection Register Group 0 Position */
#define PWM_WPCR_WPRG0_Msk                  (_U_(0x1) << PWM_WPCR_WPRG0_Pos)               /**< (PWM_WPCR) Write Protection Register Group 0 Mask */
#define PWM_WPCR_WPRG0                      PWM_WPCR_WPRG0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPCR_WPRG0_Msk instead */
#define PWM_WPCR_WPRG1_Pos                  3                                              /**< (PWM_WPCR) Write Protection Register Group 1 Position */
#define PWM_WPCR_WPRG1_Msk                  (_U_(0x1) << PWM_WPCR_WPRG1_Pos)               /**< (PWM_WPCR) Write Protection Register Group 1 Mask */
#define PWM_WPCR_WPRG1                      PWM_WPCR_WPRG1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPCR_WPRG1_Msk instead */
#define PWM_WPCR_WPRG2_Pos                  4                                              /**< (PWM_WPCR) Write Protection Register Group 2 Position */
#define PWM_WPCR_WPRG2_Msk                  (_U_(0x1) << PWM_WPCR_WPRG2_Pos)               /**< (PWM_WPCR) Write Protection Register Group 2 Mask */
#define PWM_WPCR_WPRG2                      PWM_WPCR_WPRG2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPCR_WPRG2_Msk instead */
#define PWM_WPCR_WPRG3_Pos                  5                                              /**< (PWM_WPCR) Write Protection Register Group 3 Position */
#define PWM_WPCR_WPRG3_Msk                  (_U_(0x1) << PWM_WPCR_WPRG3_Pos)               /**< (PWM_WPCR) Write Protection Register Group 3 Mask */
#define PWM_WPCR_WPRG3                      PWM_WPCR_WPRG3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPCR_WPRG3_Msk instead */
#define PWM_WPCR_WPRG4_Pos                  6                                              /**< (PWM_WPCR) Write Protection Register Group 4 Position */
#define PWM_WPCR_WPRG4_Msk                  (_U_(0x1) << PWM_WPCR_WPRG4_Pos)               /**< (PWM_WPCR) Write Protection Register Group 4 Mask */
#define PWM_WPCR_WPRG4                      PWM_WPCR_WPRG4_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPCR_WPRG4_Msk instead */
#define PWM_WPCR_WPRG5_Pos                  7                                              /**< (PWM_WPCR) Write Protection Register Group 5 Position */
#define PWM_WPCR_WPRG5_Msk                  (_U_(0x1) << PWM_WPCR_WPRG5_Pos)               /**< (PWM_WPCR) Write Protection Register Group 5 Mask */
#define PWM_WPCR_WPRG5                      PWM_WPCR_WPRG5_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPCR_WPRG5_Msk instead */
#define PWM_WPCR_WPKEY_Pos                  8                                              /**< (PWM_WPCR) Write Protection Key Position */
#define PWM_WPCR_WPKEY_Msk                  (_U_(0xFFFFFF) << PWM_WPCR_WPKEY_Pos)          /**< (PWM_WPCR) Write Protection Key Mask */
#define PWM_WPCR_WPKEY(value)               (PWM_WPCR_WPKEY_Msk & ((value) << PWM_WPCR_WPKEY_Pos))
#define   PWM_WPCR_WPKEY_PASSWD_Val         _U_(0x50574D)                                  /**< (PWM_WPCR) Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0  */
#define PWM_WPCR_WPKEY_PASSWD               (PWM_WPCR_WPKEY_PASSWD_Val << PWM_WPCR_WPKEY_Pos)  /**< (PWM_WPCR) Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0 Position  */
#define PWM_WPCR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (PWM_WPCR) Register MASK  (Use PWM_WPCR_Msk instead)  */
#define PWM_WPCR_Msk                        _U_(0xFFFFFFFF)                                /**< (PWM_WPCR) Register Mask  */

#define PWM_WPCR_WPRG_Pos                   2                                              /**< (PWM_WPCR Position) Write Protection Register Group x */
#define PWM_WPCR_WPRG_Msk                   (_U_(0x3F) << PWM_WPCR_WPRG_Pos)               /**< (PWM_WPCR Mask) WPRG */
#define PWM_WPCR_WPRG(value)                (PWM_WPCR_WPRG_Msk & ((value) << PWM_WPCR_WPRG_Pos))  

/* -------- PWM_WPSR : (PWM Offset: 0xe8) (R/ 32) PWM Write Protection Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPSWS0:1;                  /**< bit:      0  Write Protect SW Status                  */
    uint32_t WPSWS1:1;                  /**< bit:      1  Write Protect SW Status                  */
    uint32_t WPSWS2:1;                  /**< bit:      2  Write Protect SW Status                  */
    uint32_t WPSWS3:1;                  /**< bit:      3  Write Protect SW Status                  */
    uint32_t WPSWS4:1;                  /**< bit:      4  Write Protect SW Status                  */
    uint32_t WPSWS5:1;                  /**< bit:      5  Write Protect SW Status                  */
    uint32_t :1;                        /**< bit:      6  Reserved */
    uint32_t WPVS:1;                    /**< bit:      7  Write Protect Violation Status           */
    uint32_t WPHWS0:1;                  /**< bit:      8  Write Protect HW Status                  */
    uint32_t WPHWS1:1;                  /**< bit:      9  Write Protect HW Status                  */
    uint32_t WPHWS2:1;                  /**< bit:     10  Write Protect HW Status                  */
    uint32_t WPHWS3:1;                  /**< bit:     11  Write Protect HW Status                  */
    uint32_t WPHWS4:1;                  /**< bit:     12  Write Protect HW Status                  */
    uint32_t WPHWS5:1;                  /**< bit:     13  Write Protect HW Status                  */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t WPVSRC:16;                 /**< bit: 16..31  Write Protect Violation Source           */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t WPSWS:6;                   /**< bit:   0..5  Write Protect SW Status                  */
    uint32_t :2;                        /**< bit:   6..7  Reserved */
    uint32_t WPHWS:6;                   /**< bit:  8..13  Write Protect HW Status                  */
    uint32_t :18;                       /**< bit: 14..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_WPSR_Type;
