Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/include/component/pwm.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_WPSR_OFFSET                     (0xE8)                                        /**<  (PWM_WPSR) PWM Write Protection Status Register  Offset */

#define PWM_WPSR_WPSWS0_Pos                 0                                              /**< (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS0_Msk                 (_U_(0x1) << PWM_WPSR_WPSWS0_Pos)              /**< (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS0                     PWM_WPSR_WPSWS0_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPSWS0_Msk instead */
#define PWM_WPSR_WPSWS1_Pos                 1                                              /**< (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS1_Msk                 (_U_(0x1) << PWM_WPSR_WPSWS1_Pos)              /**< (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS1                     PWM_WPSR_WPSWS1_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPSWS1_Msk instead */
#define PWM_WPSR_WPSWS2_Pos                 2                                              /**< (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS2_Msk                 (_U_(0x1) << PWM_WPSR_WPSWS2_Pos)              /**< (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS2                     PWM_WPSR_WPSWS2_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPSWS2_Msk instead */
#define PWM_WPSR_WPSWS3_Pos                 3                                              /**< (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS3_Msk                 (_U_(0x1) << PWM_WPSR_WPSWS3_Pos)              /**< (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS3                     PWM_WPSR_WPSWS3_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPSWS3_Msk instead */
#define PWM_WPSR_WPSWS4_Pos                 4                                              /**< (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS4_Msk                 (_U_(0x1) << PWM_WPSR_WPSWS4_Pos)              /**< (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS4                     PWM_WPSR_WPSWS4_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPSWS4_Msk instead */
#define PWM_WPSR_WPSWS5_Pos                 5                                              /**< (PWM_WPSR) Write Protect SW Status Position */
#define PWM_WPSR_WPSWS5_Msk                 (_U_(0x1) << PWM_WPSR_WPSWS5_Pos)              /**< (PWM_WPSR) Write Protect SW Status Mask */
#define PWM_WPSR_WPSWS5                     PWM_WPSR_WPSWS5_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPSWS5_Msk instead */
#define PWM_WPSR_WPVS_Pos                   7                                              /**< (PWM_WPSR) Write Protect Violation Status Position */
#define PWM_WPSR_WPVS_Msk                   (_U_(0x1) << PWM_WPSR_WPVS_Pos)                /**< (PWM_WPSR) Write Protect Violation Status Mask */
#define PWM_WPSR_WPVS                       PWM_WPSR_WPVS_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPVS_Msk instead */
#define PWM_WPSR_WPHWS0_Pos                 8                                              /**< (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS0_Msk                 (_U_(0x1) << PWM_WPSR_WPHWS0_Pos)              /**< (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS0                     PWM_WPSR_WPHWS0_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPHWS0_Msk instead */
#define PWM_WPSR_WPHWS1_Pos                 9                                              /**< (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS1_Msk                 (_U_(0x1) << PWM_WPSR_WPHWS1_Pos)              /**< (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS1                     PWM_WPSR_WPHWS1_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPHWS1_Msk instead */
#define PWM_WPSR_WPHWS2_Pos                 10                                             /**< (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS2_Msk                 (_U_(0x1) << PWM_WPSR_WPHWS2_Pos)              /**< (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS2                     PWM_WPSR_WPHWS2_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPHWS2_Msk instead */
#define PWM_WPSR_WPHWS3_Pos                 11                                             /**< (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS3_Msk                 (_U_(0x1) << PWM_WPSR_WPHWS3_Pos)              /**< (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS3                     PWM_WPSR_WPHWS3_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPHWS3_Msk instead */
#define PWM_WPSR_WPHWS4_Pos                 12                                             /**< (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS4_Msk                 (_U_(0x1) << PWM_WPSR_WPHWS4_Pos)              /**< (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS4                     PWM_WPSR_WPHWS4_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPHWS4_Msk instead */
#define PWM_WPSR_WPHWS5_Pos                 13                                             /**< (PWM_WPSR) Write Protect HW Status Position */
#define PWM_WPSR_WPHWS5_Msk                 (_U_(0x1) << PWM_WPSR_WPHWS5_Pos)              /**< (PWM_WPSR) Write Protect HW Status Mask */
#define PWM_WPSR_WPHWS5                     PWM_WPSR_WPHWS5_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_WPSR_WPHWS5_Msk instead */
#define PWM_WPSR_WPVSRC_Pos                 16                                             /**< (PWM_WPSR) Write Protect Violation Source Position */
#define PWM_WPSR_WPVSRC_Msk                 (_U_(0xFFFF) << PWM_WPSR_WPVSRC_Pos)           /**< (PWM_WPSR) Write Protect Violation Source Mask */
#define PWM_WPSR_WPVSRC(value)              (PWM_WPSR_WPVSRC_Msk & ((value) << PWM_WPSR_WPVSRC_Pos))
#define PWM_WPSR_MASK                       _U_(0xFFFF3FBF)                                /**< \deprecated (PWM_WPSR) Register MASK  (Use PWM_WPSR_Msk instead)  */
#define PWM_WPSR_Msk                        _U_(0xFFFF3FBF)                                /**< (PWM_WPSR) Register Mask  */

